The selected fitting(s) cannot successfully change the type. You must disconnect the connections on the fitting(s) and try again.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationPartCannotChangeTypeError { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationPartCannotChangeTypeError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace